#+TITLE: Psycho Informatics
#+DESCRIPTION: Templates and Example of Pedagogical Games for testing various psychological theories about learning.
#+AUTHOR: Jérémy Barbay
#+EMAIL: jeremy@barbay.cl
#+CATEGORY: 

  The aim of the <<<Psycho Informatic>>> project is to produce generic examples of pedagogical applications for mobile devices, to be used to study the effect of various features on both persistence and learning. 

For more information, see the file:proposal.org.


* Milestones

** Simple App teaching Multiplication Tables [66%]
   - [X] Display two flashcards sides
   - [X] Generate random questions 
   - [X] Implement button Reject/Match/Joker and
   - [X] Implement scores of {true,false}.{positive,negative} answers
   - [ ] Display correct anwers after learner answered
   - [ ] Refactor code

** Simple App managing (Multiplication) FlashCards [0%]

   - [ ] Generate two random Multiplication Flashcards, and a question from it
   - [ ] Generate a deck of all $n(n-1)$ possible flashcards for multiplications
   - [ ] Manage data about past successes and failures on the $4n^2(n-1)^2$ possible questions

** Simple App managing Other types of FlashCards []
   - [ ] Check how Anki Droid manage flashcards, and in particular graphic and sound flashcards. 

* Random Ideas:
** BUSINESS model
  :CLOCK:
  CLOCK: [2015-05-19 Tue 11:25]--[2015-05-19 Tue 11:30] =>  0:05
  :END:
  :LOGBOOK:
  - State "ACTF"       from "TODO"       [2015-05-19 Tue 11:25]
  :END:
  + FREE Application
    - imposes to user (beta testers) an arbitrary
      1. game interface 
      2. Spaced Retrieval algorithm
      3. potentially erroneous game data
    - sends back usability information to server
  + PAID FOR application
    - give an informed choice (with statistics from free application) for
      1. game interface 
      2. Spaced Retrieval algorithm
      3. potentially erroneous game data
    - insures privacy of the usage data.
** A digital flashcard is not limited to two sides 
  :CLOCK:
  CLOCK: [2015-05-23 Sat 09:18]--[2015-05-23 Sat 09:36] =>  0:18
  CLOCK: [2015-05-23 Sat 09:08]--[2015-05-23 Sat 09:17] =>  0:09
  :END:
  :LOGBOOK:
  - State "ACTF"       from ""           [2015-05-23 Sat 09:18]
  - State "ACTF"       from "TODO"       [2015-05-23 Sat 09:08]
  :END:
[2015-05-23 Sat 09:08]
 - In the case of multiplication (e.g. "3*6", "18"), the third face of the Flashcard could be an array of 3 by 6 with each square numbered, such as:
   |  1 |  2 |  3 |  4 |  5 |  6 |
   |  7 |  8 |  9 | 10 | 11 | 12 |
   | 13 | 14 | 15 | 16 | 17 | 18 |
 - In the case of vocabulary (e.g. English to Spanish), it can be an image illustrating the word, or a sound illustrating its pronunciation in each language.
** Users can be asked to provide information to add to flashcards
   Examples:
   - Users can be asked to read out loud the word on a flashcard, so that the sounds forms a proposal for an additional sound, which will be validated by the game interface with other users (Many to Many teaching model).
** Games gather new information on each flashcards, which can be summarized on additional sides of the flashcard 
   Examples: 
   - false friends (Cards which are often mismatched with this particular one)
   - synonymous (other Cards from the deck which CAN be matched with this particular one, in some contect)


* Hypothesis to test
** People learn better and play longer and more regularly if the game interface presents only positive reinforcement, as opposed to a game interface with "FAIL" or "-1!" messages.
#+BEGIN_QUOTE
The field of second language acquisition has historically blamed language learning failure on a number of factors. Anxiety in the foreign language classroom (anxiety about making mistakes in grammar and pronunciation, about understanding the teacher, about remembering vocabulary) has been prominent as a purported cause of the failure. 
http://www.ldonline.org/article/6065/
#+END_QUOTE
** People learn better with (your favorite) spaced retrival algorithm
** Dislexic (and maybe general people) can learn better with colored cards for words  
Dislexic people can still still benefit from spaced retrieval in order to learn the vocabulary of a foreign language, using multi-sensorial flashcards

The same games can be designed, it requires only special sets of flashcards so that the learner matches drawings, pictures with sounds and flashcards with words, using colors to help learning the gender of names (masculine blue, feminine pink, neutral grey), the various declinations of a word (from nominative to locative, the colors of the rainbow).

#+BEGIN_QUOTE
Dyslexic pupils learning a foreign language have to be aware that it may be a longer process for them than for others. It is also important to consider the suitability of different languages.
http://www.bdadyslexia.org.uk/educator/modern-foreign-languages
#+END_QUOTE


** People play longer when the game fakes a social objective
   - Social objective such as "help the wizard to answer the questions from his neighbors", albeit obviously fake in such a game, has an effect on learners as opposed to a mechanical game.
** People play longer with fragmented levels as opposed to an infinite game
   - People play longer if they know that they lack "only x answers" to finish a level, as opposed to an infinite game which ends only by failing or only when they decide.
** People play more regularly if they are put in competitions with friends, by comparing their scores on related applications with friends on the internet, as opposed to scores from unknown people, and as opposed as not showing any competiting socres.
** Blind people can  still benefit spaced retrieval to learn, using flashcards featuring only sounds, and non-visual game interfaces, such as those inspired by "Rosetta Stone" games.

* LIST Potential names for Pedagogical game series
  :CLOCK:
  CLOCK: [2015-05-23 Sat 08:24]--[2015-05-23 Sat 08:51] =>  0:27
  :END:
  :LOGBOOK:
  - State "ACTF"       from "TODO"       [2015-05-23 Sat 08:24]
  :END:
 The idea would be to design, implement and publish a sequence of simple games, starting from the same template, each teaching a distinct topic, but each having a name following the same theme. I list here some ideas of names (brainstorming):

  - [ ] LaRaNa : (Theme) 
    - LRN are the consonants of "LeaRN"
    - "La Rana" means "The Frog" in Spanish
  - My nickname is JyBy, hence the following proposals:
  - [ ] JyByLand : (Theme)
  - [ ] JyBy University : (Theme)
  - [ ] JyBySchool : (Theme)
  - I would like to use a character of mine named "TNT", and in particular a drawing of mine showing TNT dreaming.
  - [ ] TNT University : (Theme)
  - [ ] TNT's School : (Theme)
  - [ ] TNT dreams of (Theme)
  - One theme I like is the idea that the games happen in a "dream world". 
  - [ ] The Dream School : (Theme)
  - [ ] The School of Dreams : (Theme)
  - [ ] TSoD: School of Dreams : (Theme)
  - [ ] DU (Dream University) - (Theme)
    - Menu shows TNT Dreaming about the video games

* LIST Ideas of Games for Pedagogical game series
  All games receive knowledge through pedagogical videos and flashcards, but can test this knowledge in various (ludical) ways. Here are some ideas of how it could be implemented:

    * Match and Reject :: Chimera are labeled with sides of flashcards and come by two. For each pair, you must decide if they are compatible or not, based on their flashcards. If they are compatible, you are rewarded with a drawing of them as a happy couple, showing the two flashcards side by side. If they are not, you are shown them hiting each other with the flashcards, displaying "as if by mistake" the other sides of each flash cards.  
    * Match 1 among 4 :: characters arrive to the old wizard with questions (e.g. "4*6"), who gives out answers (e.g. "24"). You are the assistant of the wizard, who hand to you a pile with the answers. The four Characters in front of the house talk all at the same time, and you must decide to which character to handle which answer. (Similar to the tank game but more pacific.)
    * Memory :: You are shown an array of back of cards all identical and offered to click on two of them, displaying their other faces. You win one point and the cards are removed if they are compatible (matching sides of the same flashcard). [Optional: An oponent is playing against you and trying to grab more cards than you!] 
    * Rosetta Stone :: Hear one word in language A, and 2 words in language B, choose which ones are associated with the first (none, first, second or both).
